#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

      - realm_id   = "moh_applications" -> null
      - role_ids   = [
          - "2e4a2cc3-bcd3-461b-9b5a-90d928f6f385",
          - "2ea1ec2c-1603-46a2-a348-6d0c7ce559da",
          - "644d3737-bff6-419d-97c5-fef873aa2483",
          - "8742c7c0-664c-4321-8225-f70420d299f7",
          - "b5b9eb31-f41e-4a3d-ba8b-86ae9559969a",
          - "beddbeb0-650e-4bd9-8484-d05f789c61b6",
          - "d50255df-43b4-4b05-9439-72c953ecbbda",
          - "e7803d5a-b7e1-48bc-b8cb-f465c3a09e11",
          - "f3622592-630f-490c-82c0-f7fb1d3cd4d1",
          - "f539f4bf-ba7a-4ba3-a8d4-a47f786e205d",
        ] -> null
    }

  # module.KEYCLOAK_PROD.module.moh_applications.module.HSPPCLIIP.keycloak_openid_client.CLIENT will be created
  + resource "keycloak_openid_client" "CLIENT" {
      + access_type                               = "CONFIDENTIAL"
      + backchannel_logout_session_required       = true
      + client_authenticator_type                 = "client-secret"
      + client_id                                 = "HSPPCLIIP"
      + client_secret                             = (sensitive value)
      + consent_required                          = false
      + description                               = "Prod configuration for HSIAR application"
      + direct_access_grants_enabled              = false
      + display_on_consent_screen                 = false
      + enabled                                   = true
      + exclude_session_state_from_auth_response  = false
      + frontchannel_logout_enabled               = false
      + full_scope_allowed                        = false
      + id                                        = (known after apply)
      + implicit_flow_enabled                     = false
      + name                                      = "HSPPCLIIP"
      + oauth2_device_authorization_grant_enabled = false
      + realm_id                                  = "moh_applications"
      + resource_server_id                        = (known after apply)
      + service_account_user_id                   = (known after apply)
      + service_accounts_enabled                  = false
      + standard_flow_enabled                     = true
      + use_refresh_tokens                        = true
      + use_refresh_tokens_client_credentials     = false
      + valid_redirect_uris                       = [
          + "https://hsppcliip.healthideas.gov.bc.ca/*",
        ]
    }

  # module.KEYCLOAK_PROD.module.moh_applications.module.HSPPCLIIP.keycloak_openid_user_client_role_protocol_mapper.client_role_mapper will be created
  + resource "keycloak_openid_user_client_role_protocol_mapper" "client_role_mapper" {
      + add_to_access_token         = true
      + add_to_id_token             = true
      + add_to_userinfo             = true
      + claim_name                  = "roles"
      + claim_value_type            = "String"
      + client_id                   = (known after apply)
      + client_id_for_role_mappings = "HSPPCLIIP"
      + id                          = (known after apply)
      + multivalued                 = true
      + name                        = "client roles"
      + realm_id                    = "moh_applications"
    }

  # module.KEYCLOAK_PROD.module.moh_applications.module.HSPPCLIIP.module.client-roles.keycloak_role.ROLES["HI_Administrator"] will be created
  + resource "keycloak_role" "ROLES" {
      + client_id = (known after apply)
      + id        = (known after apply)
      + name      = "HI_Administrator"
      + realm_id  = "moh_applications"
    }

  # module.KEYCLOAK_PROD.module.moh_applications.module.HSPPCLIIP.module.client-roles.keycloak_role.ROLES["HSPP_ALL"] will be created
  + resource "keycloak_role" "ROLES" {
      + client_id = (known after apply)
      + id        = (known after apply)
      + name      = "HSPP_ALL"
      + realm_id  = "moh_applications"
    }

  # module.KEYCLOAK_PROD.module.moh_applications.module.HSPPCLIIP.module.client-roles.keycloak_role.ROLES["HSPP_HumanResource"] will be created
  + resource "keycloak_role" "ROLES" {
      + client_id = (known after apply)
      + id        = (known after apply)
      + name      = "HSPP_HumanResource"
      + realm_id  = "moh_applications"
    }

  # module.KEYCLOAK_PROD.module.moh_applications.module.HSPPCLIIP.module.client-roles.keycloak_role.ROLES["HSPP_OKR"] will be created
  + resource "keycloak_role" "ROLES" {
      + client_id = (known after apply)
      + id        = (known after apply)
      + name      = "HSPP_OKR"
      + realm_id  = "moh_applications"
    }

Plan: 6 to add, 0 to change, 20 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pushed by: @daveb-hni, Action: `pull_request`*